{
  "basic_qualifications": "· 4+ years of professional software development experience<br/>· 3+ years of programming experience with at least one modern language such as Java, C++, or C# including object-oriented design<br/>· 2+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems<br/><br/>",
  "business_category": "aws",
  "city": "Arlington",
  "company_name": "Amazon.com Services LLC",
  "country_code": "US",
  "description": "<br/>Are you passionate about open source and engaging the developer community for a a growing service poised for the next level of growth? Are you excited about impactful technical projects that help our biggest enterprise customers manage hundreds of accounts with over a million resources across multiple regions? Amazon Web Services (AWS) is the pioneer and recognized leader in the Cloud. Our web services provide a platform for IT infrastructure that is used by hundreds of thousands of developers and businesses around the world. These customers range from start-ups to leading web companies to Global 500 companies in financial services, healthcare, and technology.<br/><br/>AWS Config is the foundation service that customers rely on to manage the configuration, and adherence to IT policy, for their cloud resources. Our customers include a large community of developers who create resources like Config rules and Conformance Packs. We are looking for an experienced Software Development Engineer who will create the services that will enable developers to create, test, deploy and share their Config artifacts. As a engineer on AWS Config, your job will be to work with an outstanding development team to implement a first-in-class experience for Config developers and contribute to one of the largest cloud resource management and compliance systems in the world.<br/><br/>In this role, you will own solutions from design and execution through deployment and support, using the best of available tools, including EC2 Native, Lambda, DynamoDB, and ElasticSearch. You will be responsible for holding the code quality high, even as we optimize our development processes to better serve our customers, and will be expected to mentor and guide junior engineers. You will engage with the open source community, listening to their feedback to improve the experience and helping to drive long term vision with the larger Config team. Most importantly, you should be comfortable working in a fast-paced environment where delivery of new products and features is very rapid. AWS Config is one of the most critical requirements for large enterprises moving to AWS.<br/><br/>The right candidate will possess proven software engineering skills, respected for contribuing to open source communities and understand how to build the best tools for developers to be effective. You are expected to be versatile and able to thrive in a dynamic, entrepreneurial environment. You are comfortable managing competing priorities and are able to bring order to ambiguous scenarios. Maturity, high judgment, ability to influence and leadership are essential to success in this role. You are data-driven and analytical. You can clearly & effectively communicate (written as well as verbally) across organizations and up to senior leadership.<br/><br/>Inclusion<br/>Here at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.<br/><br/>Work Life Balance<br/>Our team also puts a high value on work-life balance. Striking a healthy balance between your personal and professional life is crucial to your happiness and success here, which is why we aren’t focused on how many hours you spend at work or online. Instead, we’re happy to offer a flexible schedule so you can have a more productive and well-balanced life—both in and outside of work.<br/><br/><br/><br/>",
  "description_short": " Are you passionate about open source and engaging the developer community for a a growing service poised for the next level of growth? Are you excited about impactful technical projects that help our",
  "display_distance": null,
  "id": "29f2390a-26e5-4941-96f7-057fd3ac7e98",
  "id_icims": "990063",
  "job_category": "Software Development",
  "job_family": "Software Development",
  "job_path": "/en/jobs/990063/senior-software-dev-engineer",
  "job_schedule_type": "full-time",
  "location": "US, VA, Arlington",
  "normalized_location": "Arlington, Virginia, USA",
  "optional_search_labels": [
    "aws.team-sde-sdm"
  ],
  "posted_date": "November 12, 2019",
  "preferred_qualifications": "· 3+ years experience building high scale distributed systems that handle big amounts of data<br/>· Strong knowledge of data structures, algorithms, and designing for performance, scalability, availability, and internet and OS security fundamentals<br/>· Demonstrated ability to mentor other software developers in all aspects of their engineering skillsets<br/>· Experience in communicating with users, other technical teams, and senior management to collect requirements, describe software product features, product strategy and influence outcomes in technical decision-making<br/>· Experience using Amazon Web Services<br/>· Track record of building and delivering mission critical, 24x7 production software systems<br/>· Strong sense of ownership, urgency, and drive.<br/>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, visit US Disability Accommodations.<br/><br/>** For more information on Amazon Web Services, please visit http://aws.amazon.com **",
  "primary_search_label": "aws.team-sde-primary",
  "source_system": "Art",
  "state": "VA",
  "title": "Senior Software Dev Engineer",
  "university_job": null,
  "updated_time": "5 days",
  "url_next_step": "https://account.amazon.jobs/jobs/990063/apply",
  "team": {
    "id": null,
    "business_category_id": null,
    "identifier": null,
    "label": "team-sde-primary",
    "created_at": null,
    "updated_at": null,
    "image_file_name": null,
    "image_content_type": null,
    "image_file_size": null,
    "image_updated_at": null,
    "thumbnail_file_name": null,
    "thumbnail_content_type": null,
    "thumbnail_file_size": null,
    "thumbnail_updated_at": null,
    "hide_jobs": null,
    "title": null,
    "headline": null,
    "description": null
  }
}
