{
  "basic_qualifications": "· Bachelor’s degree in computer science or related technical field<br/>· 6+ years of Salesforce Development experience to include configuration, customization, programming with APEX, Lightning Web Components (LWC), Triggers, Workflows with actions, Approval Processes, Reports & Dashboards<br/>· 2+ years as lead or technical architect of a Salesforce org<br/>· Experience with Javascript, HTML CSS and ANT<br/>· Experience with Salesforce.com architecture and APIs<br/>· Experience in building complex, scalable, and high-performance software systems<br/>· Experience with integrations and knowledge of integration patterns",
  "business_category": "aws",
  "city": "Arlington",
  "company_name": "Amazon Web Services, Inc.",
  "country_code": "US",
  "description": "Amazon Web Services (“AWS”) has been the world’s most comprehensive and broadly adopted cloud platform. AWS offers over 100 fully featured services to millions of active customers around the world—including the fastest-growing startups, largest enterprises, and leading government agencies—to power their infrastructure. AWS Worldwide Revenue Operations (WWRO) is a diverse team that supports infrastructure and other foundational initiatives that span and support Sales, Marketing and Support teams within AWS.<br/><br/>The AWS Worldwide Revenue Operations Customer Relationship Management (WWRO CRM) team is looking for a passionate, innovative, results-oriented Application Engineer (Salesforce Developer) to be developing solutions that make it simpler for our field team to manage, maintain and operate at scale. As a Application Engineer in the WWRO CRM team, you will help own and contribute to defining and governing coding standards, implementing design patterns, and refactoring existing code. In addition to working on the latest Salesforce technologies such as Lightning and Einstein you will also have the opportunity to work with AWS Services to innovate in the space of Customer Relationship Management (CRM). You’ll be chartered with creating and operating applications that deliver critical capabilities to the field and embed operational knowledge and encode best practices into everything we do. In addition, as part of the broader AWS Sales and Marketing organization, you will have the opportunity to contribute to the broader cloud strategy for AWS and potentially future AWS products.<br/><br/>We have a team culture that encourages innovation and we expect team members and management alike to take high degree of ownership for their program vision and execution of ideas. You will be joining a team that is diverse and experienced in all aspects of Salesforce Development and are willing to collaborate with and mentor new members. We are looking for someone that is a self-starter, someone that approaches complex business questions with data and curiosity, and a person that dives below the surface to identify the root cause and \"so what\" rather than just superficial trends.<br/><br/>Here at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.<br/><br/>Our team also puts a high value on work-life balance. Striking a healthy balance between your personal and professional life is crucial to your happiness and success here, which is why we aren’t focused on how many hours you spend at work or online. Instead, we’re happy to offer a flexible schedule so you can have a more productive and well-balanced life—both in and outside of work.<br/><br/><br/><br/>Location: This role is open to these locations: Seattle, Dallas, TX and Arlington, VA. Relocation offered from within the US to any of these locations.<br/>",
  "description_short": "Amazon Web Services (“AWS”) has been the world’s most comprehensive and broadly adopted cloud platform. AWS offers over 100 fully featured services to millions of active customers around the world—including",
  "display_distance": null,
  "id": "64fc05df-a1a7-46e5-84b2-ba8c22f0a99c",
  "id_icims": "1496676",
  "job_category": "Software Development",
  "job_family": "It Application Engineering",
  "job_path": "/en/jobs/1496676/sr-salesforce-developer",
  "job_schedule_type": "full-time",
  "location": "US, VA, Arlington",
  "normalized_location": "Arlington, Virginia, USA",
  "optional_search_labels": [
    "aws.team-jobs-wwro"
  ],
  "posted_date": "March 25, 2021",
  "preferred_qualifications": "· Certified Salesforce Developer<br/>· Experience with large scale system design<br/>· Experience with development using AWS Services<br/>· Working knowledge of software development methodologies like Agile, Scrum, Kanban, or equivalent<br/>· Strong attention to detail, organization skills and excellent problem solving skills<br/>· Meets/exceeds Amazon’s leadership principles requirements for this role<br/>· Meets/exceeds Amazon’s functional/technical depth and complexity for this role<br/><br/>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/>",
  "primary_search_label": "aws.team-sde-primary",
  "source_system": "Art",
  "state": "VA",
  "title": "Sr. Salesforce Developer",
  "university_job": null,
  "updated_time": "4 days",
  "url_next_step": "https://account.amazon.jobs/jobs/1496676/apply",
  "team": {
    "id": null,
    "business_category_id": null,
    "identifier": null,
    "label": "team-sde-primary",
    "created_at": null,
    "updated_at": null,
    "image_file_name": null,
    "image_content_type": null,
    "image_file_size": null,
    "image_updated_at": null,
    "thumbnail_file_name": null,
    "thumbnail_content_type": null,
    "thumbnail_file_size": null,
    "thumbnail_updated_at": null,
    "hide_jobs": null,
    "title": null,
    "headline": null,
    "description": null
  }
}
