{
  "basic_qualifications": "· 2+ years of non-internship professional software development experience<br/>· Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design<br/>· 1+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems.<br/>· Bachelor's Degree in Computer Science, Mathematics or Engineering or 5+ years development experience (non internship) in lieu of degree",
  "business_category": "aws",
  "city": "Herndon",
  "company_name": "Amazon Dev Center U.S., Inc.",
  "country_code": "US",
  "description": "Amazon Web Services (AWS) is the world leader in providing a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of businesses in 190 countries around the world!<br/><br/>Passionate about building, owning and operating massively scalable systems? Experienced in building and leading teams of highly competent software engineers? Want to make a billion-dollar impact? If so, we have an exciting opportunity for you.<br/><br/>Region Build Engineering (RBE) team is dedicated to building automated platforms and solutions to streamline the AWS Region build process. Our vision is to fully automate and enable zero-touch AWS Region builds thereby reducing the time it takes to build a region and freeing engineers to focus on building new services and capabilities.<br/><br/>Region Build Engineering is a complex process requiring close collaboration with AWS service teams. We are looking for passionate innovators who want to take the challenge. Your work has visibility to leadership across AWS organization and provides huge opportunity to learn new things while solving complex engineer problems, deliver results that make impact on revenue and resources, and grow professionally and personally.<br/>Developers at Amazon work on real world problems on a global scale, own their systems end-to-end, and influence the direction of our technology that impacts hundreds of millions customers around the world. Join a team of super smart, customer obsessed developers that think big and have fun.<br/><br/>This position requires that the candidate selected be a US Citizen and obtain and maintain an active TS/SCI security clearance with polygraph.<br/><br/>Location: Herndon, VA or Arlington, VA (HQ2) options are available.<br/><br/>Here at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.<br/><br/>We are dedicated to supporting our new team members. Our team has a broad mix of experience levels and Amazon tenures, and we’re building an environment that celebrates knowledge sharing and mentorship.<br/><br/>Our team also puts a high value on work-life balance. Striking a healthy balance between your personal and professional life is crucial to your happiness and success here, which is why we aren’t focused on how many hours you spend at work or online. Instead, we’re happy to offer a flexible schedule so you can have a more productive and well-balanced life—both in and outside of work.<br/><br/><br/>",
  "description_short": "Amazon Web Services (AWS) is the world leader in providing a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of businesses in 190 countries around",
  "display_distance": null,
  "id": "891a384c-f94e-40e4-a885-bd5f30fd609f",
  "id_icims": "1497592",
  "job_category": "Software Development",
  "job_family": "Software Development",
  "job_path": "/en/jobs/1497592/software-development-engineer-aws-region-build-engineering",
  "job_schedule_type": "full-time",
  "location": "US, VA, Herndon",
  "normalized_location": "Herndon, Virginia, USA",
  "optional_search_labels": [
    "military-tech",
    "arlington-hq",
    "aws.team-region-services",
    "military",
    "aws.team-clearedvets",
    "aws.team-sde-sdm"
  ],
  "posted_date": "March 26, 2021",
  "preferred_qualifications": "· Master's Degree in Computer Science, Mathematics or Engineering<br/>· Experience building new products and services from the ground up.<br/>· Experience with React.js, Node.js and Java based web applications<br/>· Experience with building RESTful or SOAP APIs<br/>· Intermediate to advanced knowledge of computer networking and information security.<br/>· Strong communications skills; you will be required to proactively engage fellow Amazonians both inside and outside of your team.<br/>· Experience with distributed (multi-tiered) systems, algorithms, and relational databases.<br/>· Ability to effectively articulate technical challenges and solutions.<br/>· Deal well with ambiguous/undefined problems; ability to think abstractly.<br/>· Ability to synthesize requirements underlying feature requests, recommend alternative technical and business approaches, and facilitate engineering efforts to meet timelines.<br/>· Expertise in software processes, web services, multi-tiered systems, and enterprise application integration.<br/>· Meets/exceeds Amazon’s leadership principles requirements for this role<br/>· Meets/exceeds Amazon’s functional/technical depth and complexity for this role<br/><br/>*Please email AWS Sourcing Recruiter, Scott Korkowski (korkowsk@amazon.com) if you have questions.<br/><br/>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.<br/><br/>For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>**For more information on Amazon Web Services, please visit http://aws.amazon.com.**<br/><br/>This role will sit in our new headquarters in Northern Virginia, where Amazon will invest $2.5 billion dollars, occupy 4 million square feet of energy efficient office space, and create at least 25,000 new full-time jobs. Our employees and the neighboring community will also benefit from the associated investments from the Commonwealth including infrastructure updates, public transportation improvements, and new access to Reagan National Airport.<br/><br/>By working together on behalf of our customers, we are building the future one innovative product, service, and idea at a time. Are you ready to embrace the challenge? Come build the future with us.<br/><br/>",
  "primary_search_label": "aws.team-us-security-clearance-jobs-primary",
  "source_system": "Art",
  "state": "VA",
  "title": "Software Development Engineer - AWS Region Build Engineering",
  "university_job": null,
  "updated_time": "3 days",
  "url_next_step": "https://account.amazon.jobs/jobs/1497592/apply",
  "team": {
    "id": null,
    "business_category_id": null,
    "identifier": null,
    "label": "team-us-security-clearance-jobs-primary",
    "created_at": null,
    "updated_at": null,
    "image_file_name": null,
    "image_content_type": null,
    "image_file_size": null,
    "image_updated_at": null,
    "thumbnail_file_name": null,
    "thumbnail_content_type": null,
    "thumbnail_file_size": null,
    "thumbnail_updated_at": null,
    "hide_jobs": null,
    "title": null,
    "headline": null,
    "description": null
  }
}
