{
  "basic_qualifications": "· Bachelor’s degree in Computer Science (related field) or equivalent work experience<br/>· Minimum of 2 years software development experience in a combination of any of the following languages: Java, Python or TypeScript<br/>· Minimum of 2 years experience working with Linux operating system<br/><br/>",
  "business_category": "aws",
  "city": "Herndon",
  "company_name": "Amazon Dev Center U.S., Inc.",
  "country_code": "US",
  "description": "The AWS Security team owns security for all services, including EC2, S3, and many others offered by AWS. We constantly strive to earn trust by delighting our customers with scalable software services that meet the security goals from compliance to analysis. Would you like to build services using Native AWS, pursue serverless architectures, incorporate real-time collaboration features, and use purpose-built databases? If so, come join us!<br/><br/>Our team is looking for passionate software professionals to help us continue to raise the bar for cloud computing. You should be somebody who enjoys working on complex system software, is customer-centric, and feels strongly about delivering results. We do not desire to simply produce good software here at AWS Security... we want to produce disruptive, history changing innovations.<br/><br/>Amazon has a fast-paced environment where we “Work Hard, Have Fun, Make History.” A typical day on our team involves working with users to design new security features, prototyping and demonstrating features to your users, deploying software through our large automated systems, and operationally supporting your newly deployed software. You are looking for radical new approaches to automate fixes for operational issues. You use AWS services to solve design problems. You get to interact with AWS teams to integrate your application with theirs.<br/><br/>You'll be part of a world-class team in a fast-paced environment that has the entrepreneurial feel of a start-up. This is an opportunity to operate and engineer systems on a massive scale, and to gain top-notch experience in cloud computing. You'll be surrounded by people who are smart, passionate about cloud computing, and believe that simple and robust services are critical to customer success.<br/><br/>Our team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded engineer and enable them to take on more complex tasks in the future.<br/><br/>Our team also puts a high value on work-life balance. Striking a healthy balance between your personal and professional life is crucial to your happiness and success here, which is why we aren’t focused on how many hours you spend at work or online. Instead, we’re happy to offer a flexible schedule so you can have a more productive and well-balanced life—both in and outside of work.<br/><br/>Here at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.<br/><br/>This job is located in Herndon, VA.<br/><br/><br/><br/>",
  "description_short": "The AWS Security team owns security for all services, including EC2, S3, and many others offered by AWS. We constantly strive to earn trust by delighting our customers with scalable software services that",
  "display_distance": null,
  "id": "388b10d0-f37d-44d2-ad6d-48a3eef63e22",
  "id_icims": "1496414",
  "job_category": "Software Development",
  "job_family": "Software Development",
  "job_path": "/en/jobs/1496414/sde-aws-security-dev-ops",
  "job_schedule_type": "full-time",
  "location": "US, VA, Herndon",
  "normalized_location": "Herndon, Virginia, USA",
  "optional_search_labels": [
    "aws.team-sde-sdm"
  ],
  "posted_date": "March 25, 2021",
  "preferred_qualifications": "· <br/>  · In-depth knowledge of Linux/Unix tools and architecture<br/>  · Strong knowledge of web, security, and networking protocols<br/>  · Some experience with security tools such as intrusion detection, log analysis, and network scanning.<br/>  · Breadth of experience covering the \"stack\" of front-end web user interfaces and web servers through to back-end analysis and storage systems<br/>  · Highly proficient in design and analysis of algorithms and data structures<br/>  · Strong understanding of object-oriented design and implementation experience<br/>  · Experience with web-based applications and/or web services-based applications<br/>  · A person that thrives and succeeds in a hyper-growth environment where priorities shift fast<br/>  · Master's degree in Computer Science<br/>  · Meets/exceeds Amazon’s leadership principles requirements for this role<br/>  · Meets/exceeds Amazon’s functional/technical depth and complexity for this role<br/>Amazon is committed to a diverse and inclusive workforce. Amazon is an equal opportunity employer and does not discriminate on the basis of race, ethnicity, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.",
  "primary_search_label": "aws.team-sde-primary",
  "source_system": "Art",
  "state": "VA",
  "title": "SDE, AWS Security Dev Ops",
  "university_job": null,
  "updated_time": "4 days",
  "url_next_step": "https://account.amazon.jobs/jobs/1496414/apply",
  "team": {
    "id": null,
    "business_category_id": null,
    "identifier": null,
    "label": "team-sde-primary",
    "created_at": null,
    "updated_at": null,
    "image_file_name": null,
    "image_content_type": null,
    "image_file_size": null,
    "image_updated_at": null,
    "thumbnail_file_name": null,
    "thumbnail_content_type": null,
    "thumbnail_file_size": null,
    "thumbnail_updated_at": null,
    "hide_jobs": null,
    "title": null,
    "headline": null,
    "description": null
  }
}
